from django.shortcuts import render

DATA = {
    'omlet': {
        'яйца, шт': 2,
        'молоко, л': 0.1,
        'соль, ч.л.': 0.5,
    },
    'pasta': {
        'макароны, г': 0.3,
        'сыр, г': 0.05,
    },
    'buter': {
        'хлеб, ломтик': 1,
        'колбаса, ломтик': 1,
        'сыр, ломтик': 1,
        'помидор, ломтик': 1,
    },
    # можете добавить свои рецепты ;)
}

# Напишите ваш обработчик. Используйте DATA как источник данных
# Результат - render(request, 'calculator/index.html', context)
# В качестве контекста должен быть передан словарь с рецептом:
# context = {
#   'recipe': {
#     'ингредиент1': количество1,
#     'ингредиент2': количество2,
#   }
# }

def recipes(request, dish):
    if dish in DATA:
        data = DATA[dish]
        servings = request.GET.get('servings', 1)
        result = {}
        for item, value in data.items():
            new_value = value * int(servings)
            result[item] = new_value
        context = {
            'dish_name': dish,
            'recipe': result
            }
        print(context)
    else:
        context = None
    return render(request, 'calculator/index.html',context)
